Управление_торговлей.ПБТ/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ТУ</name>
    <type>
      <types>CatalogRef.ТУ</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидыСырья</name>
    <comment>Аналоги номенклатуры, являющейся сырьем</comment>
    <type>
      <types>CatalogRef.ВидыСырья</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляОтчетов</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0aac2d69-9ab2-43f6-9301-338f69242fe3">
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УпаковкаПродукта</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегатноеСостояние</name>
    <type>
      <types>EnumRef.АгрегатноеСостояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Стерилизация</name>
    <type>
      <types>EnumRef.Стерилизация</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодностиПослеВскрытияУпаковкиМес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b6e29d5d-1a98-4480-a5cf-63f1b1de2174">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/InformationRegisters/НормативыНоменклатурыЛаб/НормативыНоменклатурыЛаб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормативыНоменклатурыЛаб</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВариантСравнения</name>
    <type>
      <types>EnumRef.ВариантыСравнения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Интервал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>наАнглийскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокСл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоеОтклонение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностьЛаб</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеВыводитьВУК</name>
    <comment>0013660</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УсловияПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.Нормативы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНорматива</name>
    <type>
      <types>CatalogRef.ХарактеристикиНормативов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Р1_пбт_НормативыПосле(Команда)
	
	//ПараметрыПереходаПоГиперссылке(ИмяЭлемента, Гиперссылка = "")
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ПараметрыПереходаПоГиперссылке = Новый Структура;
	ПараметрыПереходаПоГиперссылке.Вставить("ИмяФормы", "РегистрСведений.НормативыНоменклатурыЛаб.ФормаСписка");
	ПараметрыПереходаПоГиперссылке.Вставить("ПараметрыФормы",ПараметрыФормы);
	ПараметрыПереходаПоГиперссылке.Вставить("РежимОткрытияОкнаФормы", РежимОткрытияОкнаФормы.Независимый);
	
	ГиперссылкаПерейтиСформироватьПараметрыИВопрос(ПараметрыПереходаПоГиперссылке);
	
КонецПроцедуры

Функция ДобавленныеРеквизиты()
	
	Массив = Новый Массив;
	Массив.Добавить("ВидыСырья");
	Массив.Добавить("НоменклатураДляОтчетов");
	Массив.Добавить("ТУ");
	Массив.Добавить("ДатаСоздания");
	Массив.Добавить("УпаковкаПродукта");
	Массив.Добавить("АгрегатноеСостояние");
	Массив.Добавить("Стерилизация");
	Массив.Добавить("СрокГодностиПослеВскрытияУпаковкиМес");
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура Р1_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	СписокДобавленныхРеквизитов = ДобавленныеРеквизиты();
	Для каждого Реквизит Из СписокДобавленныхРеквизитов Цикл
		ЭтотОбъект[Реквизит] = ЭтотОбъект.Объект[Реквизит];   
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура Р1_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СписокДобавленныхРеквизитов = ДобавленныеРеквизиты();
	Для каждого Реквизит Из СписокДобавленныхРеквизитов Цикл
		ТекущийОбъект[Реквизит] = ЭтотОбъект[Реквизит];   
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СвернутьРазвернутьГруппуНажатиеПосле(Элемент)
	
	СвернутьРазвернутьГруппу(Элемент);
	
КонецПроцедуры

&НаСервере
&Вместо("ИменаСворачиваемыхГрупп")
Функция Р1_ИменаСворачиваемыхГрупп()

	ИменаСворачиваемыхГрупп = ПродолжитьВызов();
	ИменаСворачиваемыхГрупп.Добавить("ДопРеквизиты");
	Возврат ИменаСворачиваемыхГрупп;
	
КонецФункции
